[{"name":"Kaam Ya'tak","region":"Central Hyrule Tower Shrine Map","challenge":"Trial of Power","details":"From the top of Central Tower, paraglide down to the southwest and head towards Mount Daphnes; the shrine is on the east side of the mountain."},{"name":"Katah Chuki","region":"Central Hyrule Tower Shrine Map","details":"This one lies northeast of Mount Gustaf, in the southeastern section of Quarry Ruins."},{"name":"Kaya Wan","region":"Central Hyrule Tower Shrine Map","challenge":"Shields from Water","details":"Head west from Wetland Stables. The stables are close to Crenel Peak, near the eastern bank of the Hylia River."},{"name":"Namika Ozz","region":"Central Hyrule Tower Shrine Map","details":"This shrine is found in the northeast section of Central Hyrule, right in the middle of the Crenel Hills."},{"name":"Noya Neha","region":"Central Hyrule Tower Shrine Map","details":"This shrine is found on the island which lies north of Quarry Ruins. It's located on the southern slope of a hill in the southwest corner. Locate the side which is overgrown with thorns and burn them away with fire. You can then use a bomb to shatter the rocks and reveal the shrine."},{"name":"Saas Ko'sah","region":"Central Hyrule Tower Shrine Map","details":"This one lies in northern section of Castle Hyrule, which makes it quite a tricky one to find due to the risk of attack. Climb the mountain on the northwest side of the fortress "},{"name":"Wahgo Katta","region":"Central Hyrule Tower Shrine Map","challenge":"Metal Connections","details":"This shrine is located on Whistling Hill, which is right next to the Riverside Stable."},{"name":"Bosh Kala","region":"Dueling Peaks Tower","challenge":"The Wind Guides You","details":"This shrine is close to Proxim bridge. Amber and a Soldier's Claymore are bonus items."},{"name":"Ha Dahamar","region":"Dueling Peaks Tower","challenge":"The Water Guides","details":"This one is right next to Dueling Peaks Stable."},{"name":"Hila Rao","region":"Dueling Peaks Tower","challenge":"Drifting","details":"This one is close to the river and is surrounded by flowers. Don't step on any of them to complete the side quest \"Watch out for the Flowers\" and gain access."},{"name":"Lakna Rokee","region":"Dueling Peaks Tower","details":"Gaining access to this shrine requires you to fulfil several side quests in Kakariko Village, making it one of the most time-consuming in the game. The first is the main quest line involving Impa which earns you the Champion's tunic. Complete \"Find the Fairy Fountain\" quest set by Pikango. \"Flown the Coop\" involves finding Cuccos for Cado "},{"name":"Ree Dahee","region":"Dueling Peaks Tower","challenge":"Timing is Critical","details":"This one is near the Dueling Peaks, close to the river. You'll have to climb to reach it."},{"name":"Shee Vaneer","region":"Dueling Peaks Tower","details":"This one lies across from Shee Venath (see below). Make sure you're wearing warm clothing as it's very cold on the peak."},{"name":"Shee Venath","region":"Dueling Peaks Tower","details":"Climb to the top of the Dueling Peaks mountain (make sure you're wearing warm clothing). Jump from the top and paraglide towards the hidden entrance. The trick to solving this puzzle is visualising a pattern from Shee Vaneer."},{"name":"Ta'loh Naeg","region":"Dueling Peaks Tower","challenge":"Ta'loh Naeg's Teaching","details":"This one is inside Kakariko Village."},{"name":"Toto Sah","region":"Dueling Peaks Tower","challenge":"Toto Sah Apparatus","details":"This lies west of Hickaly Woods. Next to the river you'll find a breakable stone structure. Drop a remote bomb into the river from a rock a little upstream so that it flows downstream to the structure. Explode the bomb at the right time to destroy the sealed gate and reveal the shrine."},{"name":"Daqa Koh","region":"Eldin Mountains Tower","details":"Head south from Goron City in the direction of the Goron Hot Springs and you'll find a railroad path. Just before you reach the path to Death Mountain you'll see the glowing orange rocks of the shrine."},{"name":"Gorae Torr","region":"Eldin Mountains Tower","details":"This one is located in the Gut Check Rock area. Use the winds to get yourself up onto the rock but make sure you have good climbing gear. You'll have to complete the quest \"The Gut Check Challenge\" set by Bayage, located nearby."},{"name":"Kayra Mah","region":"Eldin Mountains Tower","details":"This shrine is located just south of Gorko Lake, in the Gorko Tunnel. Head to a hut in the west part of Goron City and chat with Bladon to activate the \"A Brother's Roast\" quest. He'll tell you to go to Goron Tunnels "},{"name":"Mo'a Keet","region":"Eldin Mountains Tower","details":"This one lies east of Foothill Stable, on the road that leads to Eldin. It's just off the road, on a hill."},{"name":"Qua Raym","region":"Eldin Mountains Tower","challenge":"A Balanced Approach","details":"In the southwesternmost lava lake "},{"name":"Sah Dahaj","region":"Eldin Mountains Tower","challenge":"Power of Fire","details":"Glide east from Eldin Tower and drop downwards once you cross Lake Intenoch. Close to Cephla Lake "},{"name":"Shae Mo'sah","region":"Eldin Mountains Tower","details":"This one lies on the road north from Goron City."},{"name":"Shora Hah","region":"Eldin Mountains Tower","details":"This shrine is located on the Isle of Rabac. You'll need at least two pieces of the Flamebreaker armour set to get here as it's incredibly hot. Use your bombs to push the mine cart across the rails into the lava."},{"name":"Tah Muhl","region":"Eldin Mountains Tower","challenge":"Passing the Flame","details":"Head southeast from the Mo'a Keet Shrine and Foothill Stable. The shrine can be found southwest of the mountain, hidden by rock formations. This shrine forms part of the shrine quest \"A Landscape of a Stable\"."},{"name":"Kah Yah","region":"Faron Tower","details":"This one is on the beach near Mount Dunsel, in an region called Palmorae Ruins. Talk to Garini to start the quest \"A Fragmented Monument\". The first fragment is easy to find as it's close to Garini, near three palm trees. The second is on Palmorae Beach "},{"name":"Korgu Chideh","region":"Faron Tower","details":"This one is on Eventide Island in the southeast. The glide towards it takes a while so make sure you have high stamina or food which restores your stamina."},{"name":"Muwo Jeem","region":"Faron Tower","challenge":"A Modest Test of Strength","details":"On the mountain peak you can spot this shrine in the distance."},{"name":"Qukah Nata","region":"Faron Tower","details":"This is one of the game's secret shrines. To complete it you'll need to find Kaas and trigger the quest \"A Song of Storms\". The shrine is located near Calora Lake. If it's raining you can use the Cryonis rune on the waterfall and climb up, step by step. Kiss should be waiting at the top."},{"name":"Shai Utoh","region":"Faron Tower","challenge":"Halt the Tilt","details":"This one is found at Ubota Point, behind the stable. Find a breakable stone structure and blow it up to reveal the shrine."},{"name":"Shoda Sah","region":"Faron Tower","details":"This one is hidden behind the Riola Spring waterfall. A hidden path leads to the entrance."},{"name":"Tawa Jinn","region":"Faron Tower","details":"This one lies in-between Hany Pond, Rabella Wetlands and Uteh Marsh. There are five large bones and the three pressure plates which show its location. You'll need to place three spheres onto the pressure plates "},{"name":"Yah Rin","region":"Faron Tower","details":"You'll find this shrine above Lurelin Village."},{"name":"Dah Kaso","region":"Gerudo Highlands Tower","challenge":"A Minor Test of Strength","details":"There's a set of bridges "},{"name":"Joloo Nah","region":"Gerudo Highlands Tower","details":"You'll find this one north of Mount Naboroo and east of Koukot Plateau."},{"name":"Keeha Yoog","region":"Gerudo Highlands Tower","details":"On the east side of Gerudo Summit there's a mural with lighting bolts on it and a mound in the middle. Shoot the center with a Shock Arrow to expose the shrine."},{"name":"Kema Kosassa","region":"Gerudo Highlands Tower","challenge":"A Major Test of Strength","details":"This is found on Mount Agaat, north of Risoka Snowfield."},{"name":"Kuh Takkar","region":"Gerudo Highlands Tower","details":"This shrine is on Laparoh Mesa. Reaching it involves lots of climbing in cold weather, wear something warm and bring a torch, or flint and firewood "},{"name":"Sho Dantu","region":"Gerudo Highlands Tower","challenge":"Two Bombs","details":"Climb atop Gerudo Tower and paraglide to the west, then land and continue until you see a shrine mound in the middle of a circle of Luminous Stones. Destroy one of the stones with a bomb to get the Luminous Stone ore and then place it on the mound."},{"name":"Ja Baij","region":"Great Plateau Tower","challenge":"Bomb Trial","details":"This is the first shrine you'll face, and is easy to locate."},{"name":"Keh Namut","region":"Great Plateau Tower","challenge":"Cryonis Trial","details":"This one is found on Mount Hylia. You'll need food to warm you up."},{"name":"Oman Au","region":"Great Plateau Tower","challenge":"Magnesis Trial","details":"This lies north of the Temple of Time."},{"name":"Owa Daim","region":"Great Plateau Tower","challenge":"Stasis Trial","details":"This one is in the ruins south of the Temple of Time."},{"name":"Dunba Taag","region":"Hebra Mountains Tower","details":"You'll find this one in Tanagar Canyon, just south of Tama Pond. Paraglide down to the place where the canyon curves, near the windmills."},{"name":"Gee Ha'rah","region":"Hebra Mountains Tower","details":"You'll find this south of Kopeeki Drifts, which is northwest of Hebra Tower. There's is a pair of huge stone doors here; head backwards up the hill to locate some large rocks. Throw one of these down."},{"name":"Goma Asaagh","region":"Hebra Mountains Tower","details":"Paraglide down from the tower towards the southwestern side of Hebra Peak and you'll spot this shrine. Make sure you have the tools to light a fire as you'll need to melt some ice to get in."},{"name":"Hia Miu","region":"Hebra Mountains Tower","details":"This one lies northwest of Icefall Foothills. Paraglide down from the nearby mountains."},{"name":"Lanno Kooh","region":"Hebra Mountains Tower","details":"This lies west of Hebra Tower and southeast of Hebra Falls. You'll need to swim across a really cold lake, so make sure you've got the gear (or food) to stay warm."},{"name":"Maka Rah","region":"Hebra Mountains Tower","details":"At Lake Kilsie, which lies south of the Sturnida Basin, there's a pier. The shrine is just visible through a crack in the nearby wall. Blow up the rocks to ride a wind gust across the water and then follow the rocks until you get to the last wind gust will fly you upwards to an entrance which allows you to access the shrine."},{"name":"Mozo Shenno","region":"Hebra Mountains Tower","details":"This is on the east side of Biron Snowshelf. You'll have to paraglide to it from a nearby mountain."},{"name":"Qaza Tokki","region":"Hebra Mountains Tower","details":"This shrine lies within the North Lomei Labyrinth. The shrine quest is called \"Trial on the Cliff\". The fastest way to get it is to paraglide down from the nearby mountain and search for the yellow Electric Chuchu. Just a bit above their location is the entrance to the shrine. There are chest to claim if you want to do things the hard way and tackle the maze."},{"name":"Rin Oyaa","region":"Hebra Mountains Tower","challenge":"Directing the Wind","details":"Glide north from Hebra Tower, glide northward and follow the road on the ground."},{"name":"Rok Uwog","region":"Hebra Mountains Tower","details":"This ons is west of North Tabantha Snowfield."},{"name":"Sha Gehma","region":"Hebra Mountains Tower","details":"You'll find this in the north section of Tabantha Tundra."},{"name":"Shada Naw","region":"Hebra Mountains Tower","details":"This shrine lies north of Selmie's Spot, close to Hebra East Summit."},{"name":"To Quomo","region":"Hebra Mountains Tower","details":"Head to the Hebra North Summit to find this shrine. You'll be faced wth two stone doors with a snowball nearby. The idea is to roll the snowball so it smashes the doors "},{"name":"Ishto Soh","region":"Lake Hylia Tower","details":"This is east of Daval Peaks. You'll need to use your paraglider to fly towards it."},{"name":"Ka'o Makagh","region":"Lake Hylia Tower","challenge":"Metal Doors Open The Way","details":"On a hill above the stable."},{"name":"Pumaag Nitae","region":"Lake Hylia Tower","challenge":"A Minor Test of Strength","details":"This lies between Finra Woods and Pagos Woods."},{"name":"Shae Katha","region":"Lake Hylia Tower","details":"This lies north of Dracozu Lake, behind the statue of Goddess Hylia in the Spring of Courage. You'll need one of Farosh's scales."},{"name":"Shoqa Tatone","region":"Lake Hylia Tower","details":"Talk to Loone in northwest Puffer Beach to start \"Guardian Slideshow\" shrine quest. You'll need to take photos of three different Guardians "},{"name":"Ya Naga","region":"Lake Hylia Tower","challenge":"Shatter the Heavens","details":"This one is found in the middle of Hylia Island in Hylia Lake. From Lake Tower, head northwest and paraglide from there. Once inside you need to place a remote bomb on the top of the block then drop a normal bomb into the tube that runs underneath it. Detonate the bomb in the tube and then quickly switch to the remote bomb and detonate that "},{"name":"Dagah Keek","region":"Lanayru Wetlands Tower","details":"Starting at Zora's Domain, take the bridge that runs northwest. You'll eventually find Veiled Falls, and a secret shrine pressure plate. Swim up the waterfall using Zora's armour then paraglide when you reach the top "},{"name":"Daka Tuss","region":"Lanayru Wetlands Tower","challenge":"Sunken Scoop","details":"You can spot this one quite easily."},{"name":"Kah Mael","region":"Lanayru Wetlands Tower","details":"On Tingel Island you need to find a large rock. Shift it with Stasis to expose the shrine below."},{"name":"Ne'ez Yohma","region":"Lanayru Wetlands Tower","challenge":"This one is easy to find","details":"it's under the Throne Room of King Dorephan on Zora's Domain."},{"name":"Rucco Maag","region":"Lanayru Wetlands Tower","details":"This shrine is on Samasa Plain, south of Ruto Mountain."},{"name":"Shai Yota","region":"Lanayru Wetlands Tower","details":"Locate Kass just south of Horon Lagoon and complete the quest \"Master of the Wind\". The shrine will then be revealed in Horon Lagoon."},{"name":"Sheh Rata","region":"Lanayru Wetlands Tower","details":"This shrine is found on an island which lies between Crenel Peak and Zelo Pond. Burn away the bushes to enter it."},{"name":"Soh Kofi","region":"Lanayru Wetlands Tower","details":"Paraglide north from Lanayru Tower, across the water."},{"name":"Maag No'rah","region":"Hyrule Ridge Tower","details":"There's a Bokoblin camp on the slope north of Lindor's Brow which boasts a tall crow's nest. Defeat the enemies then climb to the top of this nest "},{"name":"Mijah Rokee","region":"Hyrule Ridge Tower","details":"On Washa's Bluff you need to stand on the pedestal with no clothing or armour on and wait for the Blood Moon. The shrine will then appear."},{"name":"Mogg Latan","region":"Hyrule Ridge Tower","challenge":"Synced Swing","details":"This shrine is right at the top of Satori Mountain so make sure you're prepared to do some climbing. The shrine is on the southern peak."},{"name":"Shae Loya","region":"Hyrule Ridge Tower","details":"Follow the road from Hyrule Ridge to Hebra, near Tabantha Great Bridge. Look for Tabantha Bridge Stable and then head towards the tall hill nearby."},{"name":"Sheem Dagoze","region":"Hyrule Ridge Tower","details":"This one is south of Hyrule Ridge and west from Jeddo Bridge. Make sure you complete the \"Two Rings\" quest first. You'll need to shoot an arrow through two stone hoops in a single shot."},{"name":"Toh Yahsa","region":"Hyrule Ridge Tower","details":"Head towards Thundra Plateau from the tower. In the center of it, you have to place four balls into their matching colour holes. You'll need to use Stasis to move them."},{"name":"Zalta Wa","region":"Hyrule Ridge Tower","details":"Fly from the tower towards the east and head for the Breach of Demise canyon."},{"name":"Akh Va'quot","region":"Tabantha Frontier Tower","challenge":"Windmills","details":"Due south of the Heabra Mountains you'll find a lake as well as Rito Village and the shrine."},{"name":"Bareeda Naag","region":"Tabantha Frontier Tower","details":"This lies south of Rito Village. Make sure you have a lit torch and wait until about 11AM. Hold the torch near the center of the glowing mound."},{"name":"Kah Okeo","region":"Tabantha Frontier Tower","challenge":"Wind Guide","details":"This shrine is hidden under a huge slab of rock, so use Stasis to remove it."},{"name":"Sha Warvo","region":"Tabantha Frontier Tower","details":"This one is north of Rito Village, in Dronoc's Pass."},{"name":"Tena Ko'sah","region":"Tabantha Frontier Tower","challenge":"A Major Test of Strength","details":"Near the Tabantha Great Bridge is where you'll find this shrine, amid the ruined Ancient Columns."},{"name":"Voo Lota","region":"Tabantha Frontier Tower","details":"This is west of Rito Village in the area known as Warbler's Nest. Once you've beaten the Divine Beast Vah Medoh and have found all of the sisters, you'll have to head to Warbler's Nest for a musical test. Stand in the section flanked by five statues and use a Kokoro leaf to blow air into the rock which matches the note "},{"name":"Dako Tah","region":"Gerudo Desert Tower","details":"This one is in the middle of the stone structures in the Great Cliffs area. It's easier to find at night."},{"name":"Daqo Chisay","region":"Gerudo Desert Tower","challenge":"The Whole Picture","details":"This is right next to Gerudo Town. A chest with a Thunderblade inside lies within."},{"name":"Dila Maag","region":"Gerudo Desert Tower","challenge":"Dila Maag's Blessing","details":"Glide from the Wasteland Tower to the southeast and you'll spot the South Lomei Labyrinth. The Barbarian Armour is your reward for completing this maze."},{"name":"Hawa Koth","region":"Gerudo Desert Tower","details":"This is in the southeastern section of the map, inside the Gerudo Great Skeleton / Dragon's Exile."},{"name":"Jee Noh","region":"Gerudo Desert Tower","challenge":"On the Move","details":"Head east from the Wasteland Tower and you'll spot this shrine close to the road."},{"name":"Kay Noh","region":"Gerudo Desert Tower","challenge":"Power of Electricity","details":"Take the path that runs past the Gerudo Canyon Stable and climb the rocks to the south."},{"name":"Kema Zoos","region":"Gerudo Desert Tower","challenge":"A Delayed Puzzle","details":"This one is west of Karusa Valley and northwest of West Gerudo Ruins. The shrine is found in a massive skeleton."},{"name":"Korsh O'hu","region":"Gerudo Desert Tower","challenge":"Korsh O'hu's Blessing","details":"This one lies in the East Gerudo Ruins, east of Palu Wasteland. Speak to Rotana outside Gerudo Town to start \"The Seven Heroines\" quest (he'll give you some Snow Boots). Head to the circular formation at the bottom of the mountain southwest of Wasteland Tower. You'll see the Seven Heroines statues there. Each statue has a symbol which links to one of the nearby metal balls somewhere on them. Place the balls in the appropriate basin using your Magnesis rune. The final ball can be found in the hands of the third statue from the left. Climb up the status nearby and use Magnesis to move the ball. The shrine contains a Flamespear."},{"name":"Misae Suma","region":"Gerudo Desert Tower","details":"This one is southeast of Gerudo Town, where you'll find a large rock formation. To get inside you need to finish the quest \"The Perfect Drink\", which involves gaining entrance to Gerudo Town by dressing as a woman. To get the ice to Furosa without it melting, use Stasis and hit it to move it "},{"name":"Raqa Zunzo","region":"Gerudo Desert Tower","details":"Head to the Sand Seal Rally spot south of Gerudo Town after you've defeated the nearby Divine Beast. Win the sand seal challenge to get the orb which is used to activate the shrine "},{"name":"Suma Sahma","region":"Gerudo Desert Tower","details":"This lies between Mount Granajh and Daval Peak. Roll a snowball into the puddle, then wait until the sun passes over and casts a shadow on the nearby contraption."},{"name":"Tho Kayu","region":"Gerudo Desert Tower","details":"This one is in the Toruma Dunes, with the Molduga mini-boss nearby."},{"name":"Daag Chokah","region":"Woodland Tower","details":"Take the path from the nearby Keo Ruug Shrine. You'll pass underneath a hollow tree to Tasho. Talk with him to trigger \"The Lost Pilgrimage\" quest. You then have to follow another Korok to reach the shrine's location."},{"name":"Keo Ruug","region":"Woodland Tower","challenge":"Fateful Stars","details":"You'll want to tackle this one as soon as you enter Korok Forest. It's to the right of the Master Sword."},{"name":"Ketoh Wawai","region":"Woodland Tower","details":"This shrine is in an area called Thyphlo Ruins. You need to complete the quest called \"Shrouded Shrine\" to reveal its location. Light a torch and look for the bird-shaped braziers "},{"name":"Kuhn Sidajj","region":"Woodland Tower","details":"This shrine is found by following a Korok located southwest from the first shrine. This triggers the \"Trial of Second Sight\" shrine quest "},{"name":"Maag Halan","region":"Woodland Tower","details":"Near the Keo Ruug Shrine you'll find Damia, who gives you the shrine quest \"The Test of Wood\". Fight the enemies which stand in the way of you and the Mido Swamp."},{"name":"Mirro Shaz","region":"Woodland Tower","challenge":"Tempered Power","details":"North of the small Pico Pond is where you'll find this shrine."},{"name":"Monya Toma","region":"Woodland Tower","challenge":"Drawing Parabolas","details":"You can see the glow of the shrine if you look south-east from Hebra Tower."},{"name":"Rona Kachta","region":"Woodland Tower","details":"This one lies east of Mount Drena."}]